run/postLiquefaction/testCaseBE/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices        
(
    (0 0 -50)
    (122.025 0 -50)
    (122.025 5 -50)
    (0 5 -50)
    (0 0 0)
    (122.025 0 0)
    (122.025 5 0)
    (0 5 0)
);

blocks          
(
    hex (0 1 2 3 4 5 6 7) (100 1 50) simpleGrading (1 1 1)
);  

edges           
(
);


boundary
(
    seaBed
    {
        type wall;
        faces
        (
	 (4 5 6 7)	
        ) ;
    }
     
    frontBack
    {
        type empty;
        faces
        (
	  (3 7 6 2)
          (0 1 5 4)	
        ) ;
    }  
    
    soilDomainBottom
    {
        type wall;
        faces
        (
	  (0 3 2 1 )	
        ) ;
    } 
    
    left
    {
        type splitCyclic;
        neighbourPatch  right;
        faces
        (
            (0 4 7 3)

        );
          
    }
     
     right
    {
        type splitCyclic;
        neighbourPatch  left;
        faces
        (
            (1 5 6 2)
        );
          
    }  


    r
    {
        type splitCyclic;
        neighbourPatch  l;
        faces
        (
        );
        }
    l
    {
        type splitCyclic;
        neighbourPatch  r;
        faces
        (
        );
        }


);


mergePatchPairs 
(
);

// ************************************************************************* //
