run/postLiquefaction/testCaseBE/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
   /* {
        name    cyclicFacesFaceSet;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (31.0125 0 -37.5)(91.0125 0.5 -12.5);
        }
    }

    {
        name    cyclicFacesSlaveCells;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box (-10 -1 -50)(31.0125 1 1);
        }
    }

    {
        name    cyclicFaces;
        type    faceZoneSet;
        action  new;
        source  setsToFaceZone;
        sourceInfo
        {
            faceSet cyclicFacesFaceSet;
            cellSet cyclicFacesSlaveCells;
        }
    }*/
  


   /* {
        name    baffleFaceSet;
        type    faceSet;
        action  delete;
        source  boxToFace;
        sourceInfo
        {
            box (2.5 0 -0.75)(7.5 0.5 -0.25);
        }
    }*/
    
    
    /*
      {
        name    baffleFaceSet;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
            box (31.0125 0 -37.5)(91.0125 5 -12.5);
        }
    }
    

    {
        name    baffleFaces;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet baffleFaceSet;
          
        }
    }
*/

 {
        name    baffleFaceSet;
        type    faceSet;
        action  new;
        source  boxToFace;
        sourceInfo
        {
          // box (31.0125 0 -37.5)(91.0125 5 -12.5);
          box (58.5 0 -26)(63.5 5 -23.5);
        }
    }

    {
        name    baffleFaceSet;
        type    faceSet;
        action  delete;
        source  boxToFace;
        sourceInfo
        {
           box (58.6 0 -25.5)(63.4 5 -23.8);
        }
    }

    {
        name    baffleCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            //box (32.0125 0 -36.5)(91.5 5 -11.5);
            
            box (58.5 0 -26)(63.5 5 -23.5);
        }
    }

    {
        name    baffleFaces;
        type    faceZoneSet;
        action  new;
        source  setsToFaceZone;
        sourceInfo
        {
            faceSet baffleFaceSet;
            cellSet baffleCellSet;
          
        }
    }
    
    {
        name    baffleZones;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set baffleCellSet;
          
        }
    }



);

// ************************************************************************* //
