run/postLiquefaction/testCaseBE/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

#application="biotFoam"

#cp -r 0.org 0
runApplication blockMesh
runApplication residualLiquefactionQSFoam &




